<a href="https://colab.research.google.com/github/dretcm/PYTHON-Notes/blob/master/Guide_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

<h1>Guie Pandas</h1>

# Basic

In [ ]:
import pandas as pd
a = pd.DataFrame(np.array([(1,2,3),(4,5,6)]), columns=['c0','c1','c2'], index=['r0','r1'])
print(a)

    c0  c1  c2
r0   1   2   3
r1   4   5   6

In [ ]:
import numpy as np
import pandas as pd
data = np.array([ [" ","col1","col2"] , ["fila1",22,33] , ["fila2",55,16] ])
print(pd.DataFrame(data = data[1:,1:], index = data[1:,0], columns = data[0,1:]))
# primer [1:,1:] para los elementos a mostrar, segundo index [1:,0] para los indices de las filas, tercero[0,1:] para los indices de la columna.
# salida:

      col1 col2
fila1   22   33
fila2   55   16

In [ ]:
countrys = pd.Series({"Peru":"Lima","Argentina":"Buenas Aires",
                  "Chile":"San Tiago","Mexico":"Mexico CD o DF"})
print(countrys)

Peru                   Lima
Argentina      Buenas Aires
Chile             San Tiago
Mexico       Mexico CD o DF
dtype: object

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6)]))
print(a.shape)  # imprime el tipo de martriz en ese caso es "2X3"

(2, 3)

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6)]))
print(a.index) # number of rows
print(len(a.index))

RangeIndex(start=0, stop=2, step=1)
2

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6)]))
print(a.describe())   #Esadisticas del Frame o matriz.

             0        1        2
count  2.00000  2.00000  2.00000
mean   2.50000  3.50000  4.50000
std    2.12132  2.12132  2.12132
min    1.00000  2.00000  3.00000
25%    1.75000  2.75000  3.75000
50%    2.50000  3.50000  4.50000
75%    3.25000  4.25000  5.25000
max    4.00000  5.00000  6.00000

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.mean())  # imprime la media de cada columna.

0    4.0
1    5.0
2    6.0
dtype: float64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.corr())  #para mostrar todas las coorrelaciones entre los numeros.

     0    1    2
0  1.0  1.0  1.0
1  1.0  1.0  1.0
2  1.0  1.0  1.0

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,None,6),(7,None,None)]), columns=['c0','c1','c2'], index=['r0','r1','r2'])
print(a)
print(a.count(axis=0))  #para mostrar la cantidad de los valores no nulos en las columnas(0) o filas(1).
print(a.count(axis=1))

   c0    c1    c2
r0  1     2     3
r1  4  None     6
r2  7  None  None
c0    3
c1    1
c2    2
dtype: int64
r0    3
r1    2
r2    1
dtype: int64

In [ ]:
print(a.fillna(1001)) # fill values nan with (parameter)

    c0    c1    c2
r0   1     2     3
r1   4  1001     6
r2   7  1001  1001

In [ ]:
print(a.replace(np.nan, 'hello'))

    c0     c1     c2
r0   1      2      3
r1   4  hello      6
r2   7  hello  hello

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.max(axis=0))  #para mostrar el valor mas alto en columnas(axis=0), filas(axis=1).

0    7
1    8
2    9
dtype: int64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.min())  #para mostrar el valor mas bajo.

0    1
1    2
2    3
dtype: int64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.median())  #para mostrar la mediana.

0    4.0
1    5.0
2    6.0
dtype: float64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.mean())  #para mostrar la media.

0    4.0
1    5.0
2    6.0
dtype: float64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.std())  #para mostrar la desviacion estandar.

0    3.0
1    3.0
2    3.0
dtype: float64

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]))
print(a.iloc[[0,2],:2]) # rows and columns

   0  1
0  1  2
2  7  8

In [ ]:
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]),columns=['c1','c2','c3'])
print(a.loc[[0,2]]) # rows

   c1  c2  c3
0   1   2   3
2   7   8   9

In [ ]:
#@title Functions
a = pd.DataFrame(np.array([(1,2,3),(4,5,6),(7,8,9)]),columns=['c0','c1','c2'], index=['r0','r1','r2'])
a.iloc[0] = a.apply(lambda x: x[0] + 10)
a.loc['r0'] = a.apply(lambda x: x[0] + 10)
a['average'] = a.apply(lambda x: x[0] + x[1] + x[2], axis=1)
print(a)

    c0  c1  c2  average
r0  21  22  23       66
r1   4   5   6       15
r2   7   8   9       24

In [ ]:
#@title Rename
a.rename(columns={'average':'Prom'}, inplace=True)
print(a)

    c0  c1  c2  Prom
r0  21  22  23    66
r1   4   5   6    15
r2   7   8   9    24

In [ ]:
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [1, 2, 3, 5]})
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],
                    'value': [5, 6, 7, 8]})
print(df1,'\n',df2)

  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
   rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [ ]:
# Merge df1 and df2 on the lkey and rkey columns. The value columns have the default suffixes, _x and _y, appended.
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

# Replace Excel If Function with Python Pandas

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
data = pd.read_excel('/content/sample_scores.xlsx')
data.head()

      Name  Test 1  Test 2
0  Derrick      45      34
1   Keanan      67      85
2   Jacque      89      95
3     Theo      64      97
4    Henry      58      66

In [ ]:
data['average'] = data.mean(axis=1)
data.head()

      Name  Test 1  Test 2  average
0  Derrick      45      34     39.5
1   Keanan      67      85     76.0
2   Jacque      89      95     92.0
3     Theo      64      97     80.5
4    Henry      58      66     62.0

In [ ]:
#@title One Condition
data['pass/fail'] = np.where(data['average'] > 60, 'pass', 'fail')
data.head()

      Name  Test 1  Test 2  average pass/fail
0  Derrick      45      34     39.5      fail
1   Keanan      67      85     76.0      pass
2   Jacque      89      95     92.0      pass
3     Theo      64      97     80.5      pass
4    Henry      58      66     62.0      pass

In [ ]:
data = data.drop(['pass/fail'], axis = 1)

In [ ]:
#@title Multiple Conditions
conditions = [
              (data['average'] >= 90),
              (data['average'] < 90) & (data['average'] >= 80),
              (data['average'] < 80) & (data['average'] >= 70),
              (data['average'] < 70) & (data['average'] >= 60),
              (data['average'] < 60)
]

results = ['A','B','C','D','F']

data['Grade'] = np.select(conditions, results)

data['pass/fail'] = ['pass' if x > 60 else 'fail' for x in data['average']]

data.head()

      Name  Test 1  Test 2  average Grade pass/fail
0  Derrick      45      34     39.5     F      fail
1   Keanan      67      85     76.0     C      pass
2   Jacque      89      95     92.0     A      pass
3     Theo      64      97     80.5     B      pass
4    Henry      58      66     62.0     D      pass

In [ ]:
F = dict (zip( set (data['Grade']), list (map(lambda x: list (data['Grade']).count(x), list (set (data['Grade'])) )) ))
F

{'A': 2, 'B': 5, 'C': 8, 'D': 3, 'F': 1}

In [ ]:
coff = {}

for i in data['Grade']:
  if i not in coff:
    coff[i] = 1
  else:
    coff[i] += 1
coff

{'A': 2, 'B': 5, 'C': 8, 'D': 3, 'F': 1}